<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class GroupsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('groups_')->insert([
            [1, 0, 'Электроника'],
            [2, 0, 'Одежда'],
            [3, 0, 'Бытовая техника'],
            [4, 1, 'Телефоны и смарт-часы'],
            [5, 1, 'Компьютеры и комплектующие'],
            [6, 2, 'Женщинам'],
            [7, 2, 'Мужчинам'],
            [9, 3, 'Крупная бытовая техника'],
            [10, 3, 'Встраиваемая бытовая техника'],
            [11, 4, 'Смартфоны'],
            [12, 4, 'Смарт-часы и фитнес-браслеты'],
            [13, 5, 'Комплектующие для ПК'],
            [14, 5, 'Моноблоки'],
            [15, 5, 'Системные блоки'],
            [16, 6, 'Блузы и рубашки'],
            [17, 7, 'Брюки'],
            [18, 7, 'Верхняя одежда'],
            [19, 9, 'Холодильники'],
            [20, 9, 'Морозильные камеры'],
            [21, 10, 'Стиральные машины'],
            [22, 10, 'Сушильные машины'],
            [23, 10, 'Посудомойки'],
            [24, 12, 'Смарт-часы'],
            [25, 12, 'Фитнес-браслеты'],
            [26, 12, 'Браслеты и кольца бесконтактной оплаты'],
            [27, 13, 'Жесткие диски, SSD и сетевые накопители'],
            [28, 13, 'Видеокарты и графические ускорители'],
            [29, 13, 'Оперативная память'],
            [30, 13, 'Материнские платы'],
            [31, 13, 'Процессоры'],
            [32, 16, 'Блузы'],
            [33, 16, 'Рубашки']
        ]);
    }
}
